Revit 2027 API
MEPAnalyticalSegment.Roughness Property
 The roughness of this segment, in ft.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Roughness { get; }
Public ReadOnly Property Roughness As Double
	Get
public:
property double Roughness {
	double get ();
}
member Roughness : float with get
Property Value
Double
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace